app/controllers/admin/items_controller.rb

  def create
    @item = Item.new(params[:item])
    if @item.valid?
      @item.save
---
INSERT INTO "items" ("category", "created_at", "desc", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find params[:id]
    @item.update_attributes!(params[:item])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "items" SET "desc" = '', "price" = 3.36, "category" = 'Lunch', "updated_at" = '2015-03-09 01:42:33.494997' WHERE "items"."id" = 1

  def index
    @items = Item.all
    @checked_categories = @all_categories = %w{Breakfast Lunch Dinner}
    if params[:category]
      @checked_categories = params[:category].keys
    end
    @items = Item.where(:category => @checked_categories)
---
SELECT "items".* FROM "items" WHERE "category"."Breakfast," = '1' AND "category"."Lunch," = '1'
SELECT "items".* FROM "items" WHERE "items"."category" IN ('Breakfast', 'Lunch', 'Dinner')