app/controllers/items_controller.rb

SELECT "items".* FROM "items"
INSERT INTO "items" ("category", "created_at", "desc", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def index
		@items = Item.all
		po = Item.create(name: 'pea', price: 3.4, category: 'breakfast')

SELECT "items".* FROM "items" WHERE "items"."category" = 'breakfast'
---
	def breakfast
		@items = Item.where(category: 'breakfast')

SELECT "items".* FROM "items" WHERE "items"."category" = 'lunch'
---
	def lunch
		@items = Item.where(category: 'lunch')

SELECT "items".* FROM "items" WHERE "items"."category" = 'dinner'
---
	def dinner
		@items = Item.where(category: 'dinner')